DKTrinh/STM32LAB3/Source Code/Core/Inc/main.h
/* USER CODE BEGIN Header */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SEG_A_Pin GPIO_PIN_1
#define SEG_A_GPIO_Port GPIOA
#define SEG_B_Pin GPIO_PIN_2
#define SEG_B_GPIO_Port GPIOA
#define SEG_C_Pin GPIO_PIN_3
#define SEG_C_GPIO_Port GPIOA
#define SEG_D_Pin GPIO_PIN_4
#define SEG_D_GPIO_Port GPIOA
#define SEG_E_Pin GPIO_PIN_5
#define SEG_E_GPIO_Port GPIOA
#define SEG_F_Pin GPIO_PIN_6
#define SEG_F_GPIO_Port GPIOA
#define SEG_G_Pin GPIO_PIN_7
#define SEG_G_GPIO_Port GPIOA
#define BUTTON_0_Pin GPIO_PIN_0
#define BUTTON_0_GPIO_Port GPIOB
#define BUTTON_1_Pin GPIO_PIN_1
#define BUTTON_1_GPIO_Port GPIOB
#define BUTTON_2_Pin GPIO_PIN_2
#define BUTTON_2_GPIO_Port GPIOB
#define EN1_Pin GPIO_PIN_10
#define EN1_GPIO_Port GPIOB
#define EN2_Pin GPIO_PIN_11
#define EN2_GPIO_Port GPIOB
#define EN3_Pin GPIO_PIN_12
#define EN3_GPIO_Port GPIOB
#define LED_RED1_Pin GPIO_PIN_3
#define LED_RED1_GPIO_Port GPIOB
#define LED_GREEN1_Pin GPIO_PIN_4
#define LED_GREEN1_GPIO_Port GPIOB
#define LED_AMBER1_Pin GPIO_PIN_5
#define LED_AMBER1_GPIO_Port GPIOB
#define LED_RED2_Pin GPIO_PIN_6
#define LED_RED2_GPIO_Port GPIOB
#define LED_GREEN2_Pin GPIO_PIN_7
#define LED_GREEN2_GPIO_Port GPIOB
#define LED_AMBER2_Pin GPIO_PIN_8
#define LED_AMBER2_GPIO_Port GPIOB
#define EN0_Pin GPIO_PIN_9
#define EN0_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
